; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v6)
             (pred_1 ?v1 ?v8)
             (pred_11 ?v7 ?v8)
             (pred_12 ?v4 ?v7 )
	     (pred_10 ?v7)
             (pred_8 ?v2)
             (pred_9 ?v1)
             (pred_5 ?v8)
             (pred_2 ?v7)
             (pred_7 ?v1)
             (pred_3 ?v7)
             (pred_4 ))



(:action op_2
:parameters (?v13 ?v5 ?v11 ?v10)
:precondition (and (pred_8 ?v13) (pred_8 ?v5) (pred_9 ?v11) (pred_5 ?v10)
          (pred_6 ?v13 ?v5) (pred_1 ?v11 ?v10)
                   (pred_11 ?v5 ?v10) (pred_10 ?v13) 
                   (pred_2 ?v5) (pred_7 ?v11))
:effect (and  (pred_3 ?v5) (not (pred_2 ?v5))))


(:action op_1
:parameters (?v13 ?v12)
:precondition (and (pred_8 ?v13) (pred_8 ?v12)
               (pred_10 ?v13) (pred_6 ?v13 ?v12) (pred_3 ?v12))
:effect (and (pred_10 ?v12) (not (pred_10 ?v13))))

(:action op_4
:parameters (?v13 ?v11)
:precondition (and (pred_8 ?v13) (pred_9 ?v11) 
                  (pred_10 ?v13) (pred_12 ?v11 ?v13) (pred_4 ))
:effect (and (pred_7 ?v11)
   (not (pred_12 ?v11 ?v13)) (not (pred_4 ))))


(:action op_3
:parameters (?v13 ?v9 ?v3)
:precondition (and (pred_8 ?v13) (pred_9 ?v9) (pred_9 ?v3)
                  (pred_10 ?v13) (pred_7 ?v3) (pred_12 ?v9 ?v13))
:effect (and (pred_7 ?v9) (pred_12 ?v3 ?v13)
        (not (pred_7 ?v3)) (not (pred_12 ?v9 ?v13))))

(:action op_5
:parameters (?v13 ?v11)
:precondition (and (pred_8 ?v13) (pred_9 ?v11) 
                  (pred_10 ?v13) (pred_7 ?v11))
:effect (and (pred_4 ) (pred_12 ?v11 ?v13) (not (pred_7 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_22 obj_05 obj_29 obj_12 obj_08 obj_04 obj_18 obj_16 obj_07 obj_19 obj_21 obj_09 obj_03 obj_15 obj_30 obj_06 obj_13 obj_11 obj_17 obj_02 obj_25 obj_31 obj_27 obj_20
    obj_28 obj_01 obj_24
    obj_14 obj_23 obj_10
    )

    (:init
       (pred_4)

       (pred_8 obj_26)
       (pred_8 obj_22)
       (pred_8 obj_05)
       (pred_8 obj_29)
       (pred_8 obj_12)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_18)
       (pred_8 obj_16)
       (pred_8 obj_07)
       (pred_8 obj_19)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_03)
       (pred_8 obj_15)
       (pred_8 obj_30)
       (pred_8 obj_06)
       (pred_8 obj_13)
       (pred_8 obj_11)
       (pred_8 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_25)
       (pred_8 obj_31)
       (pred_8 obj_27)
       (pred_8 obj_20)
       (pred_5 obj_28)
       (pred_5 obj_01)
       (pred_5 obj_24)
       (pred_9 obj_14)
       (pred_9 obj_23)
       (pred_9 obj_10)

       (pred_6 obj_26 obj_08)
       (pred_6 obj_26 obj_22)
       (pred_6 obj_22 obj_04)
       (pred_6 obj_22 obj_05)
       (pred_6 obj_22 obj_26)
       (pred_6 obj_05 obj_18)
       (pred_6 obj_05 obj_29)
       (pred_6 obj_05 obj_22)
       (pred_6 obj_29 obj_16)
       (pred_6 obj_29 obj_12)
       (pred_6 obj_29 obj_05)
       (pred_6 obj_12 obj_07)
       (pred_6 obj_12 obj_29)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_26)
       (pred_6 obj_04 obj_21)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_04 obj_22)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_18 obj_09)
       (pred_6 obj_18 obj_16)
       (pred_6 obj_18 obj_05)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_16 obj_03)
       (pred_6 obj_16 obj_07)
       (pred_6 obj_16 obj_29)
       (pred_6 obj_16 obj_18)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_07 obj_16)
       (pred_6 obj_19 obj_30)
       (pred_6 obj_19 obj_21)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_21 obj_06)
       (pred_6 obj_21 obj_09)
       (pred_6 obj_21 obj_04)
       (pred_6 obj_21 obj_19)
       (pred_6 obj_09 obj_13)
       (pred_6 obj_09 obj_03)
       (pred_6 obj_09 obj_18)
       (pred_6 obj_09 obj_21)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_03 obj_15)
       (pred_6 obj_03 obj_16)
       (pred_6 obj_03 obj_09)
       (pred_6 obj_15 obj_17)
       (pred_6 obj_15 obj_07)
       (pred_6 obj_15 obj_03)
       (pred_6 obj_30 obj_02)
       (pred_6 obj_30 obj_06)
       (pred_6 obj_30 obj_19)
       (pred_6 obj_06 obj_25)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_21)
       (pred_6 obj_06 obj_30)
       (pred_6 obj_13 obj_31)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_09)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_11 obj_27)
       (pred_6 obj_11 obj_17)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_17 obj_20)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_17 obj_11)
       (pred_6 obj_02 obj_25)
       (pred_6 obj_02 obj_30)
       (pred_6 obj_25 obj_31)
       (pred_6 obj_25 obj_06)
       (pred_6 obj_25 obj_02)
       (pred_6 obj_31 obj_27)
       (pred_6 obj_31 obj_13)
       (pred_6 obj_31 obj_25)
       (pred_6 obj_27 obj_20)
       (pred_6 obj_27 obj_11)
       (pred_6 obj_27 obj_31)
       (pred_6 obj_20 obj_17)
       (pred_6 obj_20 obj_27)
       (pred_2 obj_13)
       (pred_2 obj_09)
       (pred_2 obj_30)
       (pred_11  obj_13 obj_28)
       (pred_11  obj_09 obj_01)
       (pred_11  obj_30 obj_24)
       (pred_3 obj_26)
       (pred_3 obj_22)
       (pred_3 obj_05)
       (pred_3 obj_29)
       (pred_3 obj_12)
       (pred_3 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_18)
       (pred_3 obj_16)
       (pred_3 obj_07)
       (pred_3 obj_19)
       (pred_3 obj_21)
       (pred_3 obj_03)
       (pred_3 obj_15)
       (pred_3 obj_06)
       (pred_3 obj_11)
       (pred_3 obj_17)
       (pred_3 obj_02)
       (pred_3 obj_25)
       (pred_3 obj_31)
       (pred_3 obj_27)
       (pred_3 obj_20)

       (pred_1  obj_14 obj_28)
       (pred_1  obj_23 obj_01)
       (pred_1  obj_10 obj_24)
       (pred_12 obj_14 obj_05)
       (pred_12 obj_23 obj_06)
       (pred_12 obj_10 obj_27)
       (pred_10 obj_22)
    )

    (:goal (and
       (pred_12 obj_14 obj_12)
       (pred_12 obj_23 obj_02)
    ))
(:constraints
  (always (not (pred_10 obj_29)))
)
)

; plan
1. (op_1 obj_22 obj_05)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_05)
   goals met: 0 of 2
2. (op_4 obj_05 obj_14)
   deleted: (pred_12 obj_14 obj_05) (pred_4)
   added: (pred_7 obj_14)
   goals met: 0 of 2
3. (op_1 obj_05 obj_22)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_22)
   goals met: 0 of 2
4. (op_1 obj_22 obj_04)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_04)
   goals met: 0 of 2
5. (op_1 obj_04 obj_21)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_21)
   goals met: 0 of 2
6. (op_1 obj_21 obj_06)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_06)
   goals met: 0 of 2
7. (op_3 obj_06 obj_23 obj_14)
   deleted: (pred_7 obj_14) (pred_12 obj_23 obj_06)
   added: (pred_7 obj_23) (pred_12 obj_14 obj_06)
   goals met: 0 of 2
8. (op_1 obj_06 obj_25)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_25)
   goals met: 0 of 2
9. (op_1 obj_25 obj_02)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_02)
   goals met: 0 of 2
10. (op_5 obj_02 obj_23)
   deleted: (pred_7 obj_23)
   added: (pred_4) (pred_12 obj_23 obj_02)
   goals met: 1 of 2
11. (op_1 obj_02 obj_25)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_25)
   goals met: 1 of 2
12. (op_1 obj_25 obj_06)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_06)
   goals met: 1 of 2
13. (op_4 obj_06 obj_14)
   deleted: (pred_12 obj_14 obj_06) (pred_4)
   added: (pred_7 obj_14)
   goals met: 1 of 2
14. (op_1 obj_06 obj_21)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_21)
   goals met: 1 of 2
15. (op_1 obj_21 obj_04)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_04)
   goals met: 1 of 2
16. (op_1 obj_04 obj_18)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_18)
   goals met: 1 of 2
17. (op_1 obj_18 obj_16)
   deleted: (pred_10 obj_18)
   added: (pred_10 obj_16)
   goals met: 1 of 2
18. (op_1 obj_16 obj_07)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_07)
   goals met: 1 of 2
19. (op_1 obj_07 obj_12)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_12)
   goals met: 1 of 2
20. (op_5 obj_12 obj_14)
   deleted: (pred_7 obj_14)
   added: (pred_4) (pred_12 obj_14 obj_12)
   goals met: 2 of 2
